tap "homebrew/bundle"

# Shell
brew "zsh"
brew "stow"

# Editor & terminal multiplexer
brew "neovim"
brew "tmux"

# Search & fuzzy find
brew "fzf"
brew "ripgrep"

# Version manager (replaces asdf)
brew "mise"

# Core utilities
brew "git"
brew "curl"
brew "wget"
brew "jq"

# Kubernetes / cloud
brew "kubectl"
brew "helm"
brew "awscli"

# Database client
brew "postgresql@16", link: true

# GUI apps
cask "alacritty"
cask "firefox"
